Revit 2026 API

# ViewScheduleSplit(IListDouble) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Split(
	IList<double> segmentHeights
)
```
```vb
Public Sub Split (
	segmentHeights As IList(Of Double)
)
```
```cpp
public:
void Split(
	IList<double>^ segmentHeights
)
```
```fsharp
member Split :
        segmentHeights : IList<float> -> unit
```

#### Parameters

segmentHeights IListDouble

#### Reference

ViewSchedule Class

Split Overload

Autodesk.Revit.DB Namespace